[{
"title": "Notices and Updates",
"documentTitle": "Announcements & General Information",
"url": "/opendoc-sp-self-help-centre/1Geninfo/Announcements.html",
"text": "Notices and Updates"
}
,{
"title": "(1) Notice of Office Closure",
"documentTitle": "Announcements & General Information",
"url": "/opendoc-sp-self-help-centre/1Geninfo/Announcements.html#1-notice-of-office-closure",
"text": "(1) Notice of Office Closure The PACE Academy office will be closed throughout the COVID-19 Circuit Breaker period until further notice. However, please be assured that all of our online services are still operating normally, including the PACE Hotline (6772-1288). [15 June 2020]"
}
,{
"title": "(2) Status of PACE Progammes/Courses",
"documentTitle": "Announcements & General Information",
"url": "/opendoc-sp-self-help-centre/1Geninfo/Announcements.html#2-status-of-pace-progammescourses",
"text": "(2) Status of PACE Progammes/Courses Given the current COVID-19 situation, the PACE Academy will be moving most of our programmes and courses onto e-learning or online instruction mode. However, for certain affected programmes and courses, we may issue a notice for postponement or cancellation. As to how the Circurit Breaker measures are being eased, the academy may be allowed to offer classroom based courses again, albeit with restrictions to ensure safety. Our programme administrators will be communicating on these alternative arrangements to all trainers, students and participants accordingly. [16 June 2020]"
}
,{
"title": "Getting here",
"documentTitle": "Announcements & General Information",
"url": "/opendoc-sp-self-help-centre/1Geninfo/Gettinghere.html",
"text": "Getting here The PACE Academy is located within the Singapore Polytechnic (SP) and almost all of our courses are conducted within its premises. You may find the following guides useful in your navigation to and around campus."
}
,{
"title": "Getting to the Singapore Polytechnic Campus",
"documentTitle": "Announcements & General Information",
"url": "/opendoc-sp-self-help-centre/1Geninfo/Gettinghere.html#getting-to-the-singapore-polytechnic-campus",
"text": "Getting to the Singapore Polytechnic Campus Map of SP Directions to SP"
}
,{
"title": "Getting to the PACE Academy Office at Block T1A",
"documentTitle": "Announcements & General Information",
"url": "/opendoc-sp-self-help-centre/1Geninfo/Gettinghere.html#getting-to-the-pace-academy-office-at-block-t1a",
"text": "Getting to the PACE Academy Office at Block T1A WALKING GUIDE VIDEOS We have also prepared these videos which will guide you on how you can walk or drive to the PACE Academy from: Walk from Dover MRT Walk from Gate 1 (Drop off point at Admin Block 1 via Dover Road) Drive from Gate 1 (via Dover Road Road) Drive from Gate 8 (via Commonwealth Avenue West Road)"
}
,{
"title": "Establishment of the One-Stop Centre (OSC) in the Singapore Polytechnic",
"documentTitle": "Announcements & General Information",
"url": "/opendoc-sp-self-help-centre/1Geninfo/OSC.html",
"text": "Establishment of the One-Stop Centre (OSC) in the Singapore Polytechnic Dear all, We are pleased to inform you that, with effect from 01 October 2019 (Tuesday), the Singapore Polytechnic will consolidate its customer service functions to a single convenient location at: The One-Stop-Centre (currently, the Student Service Centre) Blk T1611 500 Dover Road, Singapore Polytechnic Singapore 139651 (Located at level 1/Ground floor. The centre is directly facing the Dover MRT and next to McDonald’s inside the campus) All PACE Academy customer services will henceforth be provided from the OSC, including: General enquiries Document submissions Registrations Collections Appointments with PACE staff Payments (excluding cash payments) Enrolment With the implementation of the OSC, the PACE Academy will cease its counter operations and services. Should you require any further assistance, please contact us at our hotline at 6772-1288 or email to pace@sp.edu.sg."
}
,{
"title": "Advice to all PACE trainers/ALs",
"documentTitle": "Announcements & General Information",
"url": "/opendoc-sp-self-help-centre/1Geninfo/OSC.html#advice-to-all-pace-trainersals",
"text": "Advice to all PACE trainers/ALs Please liaise closely with your respective programme administrators pertaining to all matters concerning course administration in light of this development. If you need further assistance, please send a WhatsApp message to 8607-5440."
}
,{
"title": "Useful link",
"documentTitle": "Announcements & General Information",
"url": "/opendoc-sp-self-help-centre/1Geninfo/OSC.html#useful-link",
"text": "Useful link OSC Microsite [20 March 2020]"
}
,{
"title": "Common Technical Issues Faced by Users",
"documentTitle": "Technical e-Helpdesk",
"url": "/opendoc-sp-self-help-centre/2Tech/Commontech.html",
"text": "Common Technical Issues Faced by Users Please take a moment to read through the following for a better understanding on how to overcome commonly reported technical issues."
}
,{
"title": "(1) PACE Academy e-Services Diagnostics Page (Pop-Up issue)",
"documentTitle": "Technical e-Helpdesk",
"url": "/opendoc-sp-self-help-centre/2Tech/Commontech.html#1-pace-academy-e-services-diagnostics-page-pop-up-issue",
"text": "(1) PACE Academy e-Services Diagnostics Page (Pop-Up issue) DESCRIPTION This is service is provided for your convenience as it will assist to determine whether your device is configured according to the technical requirements of our online services i.e. to ensure the smooth processing of your application and/or payment. PROBLEM Most post-2000 internet browsers have configured pop-ups to be blocked by default and cookies automatically enabled. Therefore, this error might be most commonly experienced by users: SOLUTION Please refer to the following link on how you may find help to unblock your pop-up or enable it. Self-Help Guide - Pop up issue (Might take some time to load)"
}
,{
"title": "(2) Operating under highly secured networks or strict IT policy",
"documentTitle": "Technical e-Helpdesk",
"url": "/opendoc-sp-self-help-centre/2Tech/Commontech.html#2-operating-under-highly-secured-networks-or-strict-it-policy",
"text": "(2) Operating under highly secured networks or strict IT policy DESCRIPTION/PROBLEM Some users might be attempting registration/payment using a company issued notebook or device which may be heavily controlled in terms of technical features and configuration. This will prevent you from enabling pop-ups/cookies. You are also advised not to attempt any registration or payment while being connected to either a highly secured network or a network which has strict IT policy e.g. firewall configurations etc. This is because our online services may be affected under such conditions. SOLUTION You should be able to overcome this by simply: switch to your own personal internet network or mobile data AND/OR using a personal computer e.g. desktop PC or notebook etc. If you are required to do the registration officially using your company issued notebook or device, please send in a request for a direct registration link by contacting us at the PACE Hotline at 6772 1288 or email to pace@sp.edu.sg."
}
,{
"title": "(3) Error message - ORACLE/CEMS User Login Page (Requesting for UserID and Password)",
"documentTitle": "Technical e-Helpdesk",
"url": "/opendoc-sp-self-help-centre/2Tech/Commontech.html#3-error-message---oraclecems-user-login-page-requesting-for-userid-and-password",
"text": "(3) Error message - ORACLE/CEMS User Login Page (Requesting for UserID and Password) DESCRIPTION/PROBLEM This is an irregular response from our server which could be due to several reasons including: (i) Time out - idled for more than 15 mins. (ii) Made multiple or concurrent visits to our website/registration page using several tabs or other browsers. SOLUTION If the above error is encountered, users are advised to perform the following: Completely clear your cache, cookies, browser history and temporary files and restart the browser afresh AND/OR Shutdown the notebook or device completely (for smartphones, please ensure the app is killed/deactivated first) and turning it back on again. After doing so, please make another attempt at registration/payment."
}
,{
"title": "(4) Error Message - “Please do not close this window” Page Status",
"documentTitle": "Technical e-Helpdesk",
"url": "/opendoc-sp-self-help-centre/2Tech/Commontech.html#4-error-message---please-do-not-close-this-window-page-status",
"text": "(4) Error Message - “Please do not close this window” Page Status DESCRIPTION/PROBLEM This is a response from our server which is caused by a default pop-up blocking feature found on your device or internet browser. (You might have somehow skipped the Diagnostics Test) SOLUTION You may simply proceed to enable your pop-ups as per the solutions recommended under Issue (1) above."
}
,{
"title": "(5) Unable to click on the “Next” Button during registration",
"documentTitle": "Technical e-Helpdesk",
"url": "/opendoc-sp-self-help-centre/2Tech/Commontech.html#5-unable-to-click-on-the-next-button-during-registration",
"text": "(5) Unable to click on the “Next” Button during registration DESCRIPTION/PROBLEM In order to be able to click on the “Next” button during registration, ensure that you have clicked the “Save” button first. Do not click on the “Main Menu” button as it will reset the form. SOLUTION If you are unable to proceed, look out for any prompted message in red found on the form. You should resolve those messages in order to proceed with your registration."
}
,{
"title": "Quick Troubleshooting Checklist",
"documentTitle": "Technical e-Helpdesk",
"url": "/opendoc-sp-self-help-centre/2Tech/Commontech.html#quick-troubleshooting-checklist",
"text": "Quick Troubleshooting Checklist If you got lost in the explanation above, you may refer to this checklist for a quick run down of the explanations: 1) Use your personal network to connect to the internet. (Office network may adversely affect our online service because of certain firewall configurations etc.) 2) Perform registration after a proper shutdown and reboot. (This is to prevent/clear any cache/cookie problems) 3) Use an up-to-date computer and stable internet browser. (e.g. most updated windows patch, Google Chrome or Mozilla Firefox) 4) Try not to multi-task while attempting registration. Do not run other programs requiring resource intensive programs. 5) Set aside sufficient time for your registration Do not risk being timed out. 6) Check your inputs Take your time to ensure that all information provide are accurate, correct and error-free. (After completing each registration stage, click on the “Save” button and after that the “Next” button to proceed on.) 7) Click on the “Proceed” button Please note down your Registration ID to end the entire registration process for your reference."
}
,{
"title": "How to use Microsoft Teams",
"documentTitle": "Technical e-Helpdesk",
"url": "/opendoc-sp-self-help-centre/2Tech/MSTeams.html",
"text": "How to use Microsoft Teams Microsoft(MS) Teams is a unified communication and collaboration platform that combines persistent workplace chat, video meetings, file storage (including collaboration on files), and application integration. If your lecturer/trainer has invited you to join a session using MS Teams, please log in to your iChat account before joining any online meeting invitation. If you do not have the software, you may login to your Microsoft account portal and download it. SP staff should download using the Software Center app. You may refer to the following video instructional guide on how to use this teleconferencing program: As the above video is from an external source, the PACE Academy, Singapore Polytechnic, will not be responsible for its quality and/or contents. For reference purposes only."
}
,{
"title": "",
"documentTitle": "Technical e-Helpdesk",
"url": "/opendoc-sp-self-help-centre/2Tech/Registration.html",
"text": "&lt;h1"
}
,{
"title": "Attending a course at the PACE Academy",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Attendcourse.html",
"text": "Attending a course at the PACE Academy"
}
,{
"title": "Step 1: Search for a course",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Attendcourse.html#step-1-search-for-a-course",
"text": "Step 1: Search for a course How do I search for CET courses and find relevant course details on the PACE Academy website? Navigate to your programme/course web page by clicking here –&gt; PACE Full Course Listing Please ensure that you have understood the requirements of the programme/course as well as its application procedure. You may also refer to the instructional video below:"
}
,{
"title": "Step 2: Understand course details",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Attendcourse.html#step-2-understand-course-details",
"text": "Step 2: Understand course details Minimum Entry Requirements and Supporting documents Before registering, please ensure that you are familiar with the Minimum Entry Requirements and prepare the relevant documents in softcopy to support your registration, among other things. For example, if a course requires that you are required to meet the O levels qualification, please scan your O Levels results in PDF format and upload it during your registration."
}
,{
"title": "Step 3: Check for course availability",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Attendcourse.html#step-3-check-for-course-availability",
"text": "Step 3: Check for course availability (i) Find the next intake/run details Refer to the programme/course web page for upcoming intake/run details. It will usually be displayed under Important Dates on the right portion of the webpage. (ii) Determine availability If there is an upcoming intake/run stated on the programme/course web page, you may determine availability (placements are limited and on first-come-first-application basis) by clicking on the “Register Here” button. (iii) Choosing an available intake/run If there is no course date displayed, the course offered on our web page may have yet to open or is already closed for registration. You may register for this service to be notified once registration for the next course run is made available - Registration of Interest (ROI)* Otherwise, if an intake/run date is available you to register, you will be automatically be shown dates as per the following example."
}
,{
"title": "Step 4: Prepare to register",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Attendcourse.html#step-4-prepare-to-register",
"text": "Step 4: Prepare to register (i) Accepted Mode of Registration Please note that registration for ALL programmes/courses offered by the PACE Academy, Singapore Polytechnic, is done strictly online. We do not accept any manual/hardcopy registration or registration via the phone or email for proper administrative and security purposes. (ii) Types of Registrations: Individual, Group or Company Sponsored? Depending on the course offered, there are several options for registration such as the following: Individual - for anyone who would like to register and make payment for himself/herself. Certain subsidies are only applicable for this registration option. Group - similar to Individual registration. However, this option allows you to register as a group (multiple registrants under one Registration ID). Company Sponsored - for company which are intending to sponsor staff for a course. This registration options allows for 1 and up to 10 staff/registrants to be registered at one time. The company is not expected to make payment immediately, rather PACE Academy will invoice the said company once the course is confirmed to run. Certain subsidies are only applicable for this registration option. (iii) Proceeding with registration In order to choose and register for the preferred course run schedule, fill in the information and acknowledgements required, and the “Apply” column will appear automatically on the right side. Note: If you disagree with or cannot meet the requirements, you should not/will not be allowed to proceed with the registration You may then click on any of the registration options to proceed as per the examples illustrated below: Option 1 - “Register with SingPass” (Requires 2FA. The MyInfo service is available with this registration option to auto-fill your registration form) Option 2 - “Register without SingPass” (Manually keying in all the required details) Option 3 - “Wait List” (Common option for enrolment based courses to check on eligibility first without requiring payment in order to facilitate the administration of the course offering) OR (iv) Who should be registering? Individual - The named individual who will be participating in the course must be the person registering. Group - All or one of the named individual who will be participating in the course must be the person(s) registering. Company Sponsored - Please select the “Company Sponsored” option during registration. We encourage the registrant to be a representative of the company (HR or Training Manager) who knows the required corporate information for this registration. (v) Self-Diagnostics Test To facilitate your registration, please proceed with the diagnostics test. These tests are non-invasive and designed/intended to ensure smooth and reliable experience with our e-services. If further action is required from you, please follow the guides as prompted. Note: Under some circumstances, you might find a blank page after clicking the Proceed button. Press F5 on your keyboard to refresh/reload the page."
}
,{
"title": "Step 5: Register",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Attendcourse.html#step-5-register",
"text": "Step 5: Register (i) Complete the registration form through all the stages. Please input all mandatory fields with relevant information. Please be accurate and complete at every stage of the registration. If you had chosen to register using your SingPass account, the “Populate Details from MyInfo” button should be visible on the top right of the registration form (as shown below) Click on it to activate the auto-fill should be visible on the top right of the registration form (as shown below). Click on it to activate the auto fill service. To proceed to the next stage of registration, click on the Save button and followed by the Next button: BEFORE clicking on the Save button AFTER clicking on the Save button (ii) Attaching supporting documents Certain programme/course registration will require you to upload your supporting documents along with your registration. Note: For some courses, the uploading of personal identification documents such as NRIC is required and necessary in order to ascertain the applicant’s eligibility for course subsidies provided by SkillsFuture Singapore (SSG) and/or other agencies. This is in line with PDPC’s NRIC advisory guidelines to ensure the appropriate use of public funds. For this purpose, you would need to upload your attachment by clicking on the “Add Attachment” button. If you need to upload more documents, you may do so by clicking on the “Add Another Doc” button as illustrated below. On the other hand, you may remove a row by clicking on the “Delete Row” button. (iii) Concluding registration Check the details under the Registration Summary page. This is the final stage of registration. If you would like to proceed to confirm the registration, click on the “Proceed” button."
}
,{
"title": "Step 6: Make payment online",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Attendcourse.html#step-6-make-payment-online",
"text": "Step 6: Make payment online Note: This guide is meant for those who are registering as individuals or in a group where payment is expected immediately after registration. For company sponsored registrations, please await for further payment instructions based on our invoicing. (i) Preparing your device Please ensure that your pop-up is enabled (or blocker disabled) before proceeding further. This should have been resolved by the Self-Diagnostic Test page. (ii) Choice of Internet Browser If you are unable to use Internet Edge or Safari, we recommend using Google Chrome instead. (iii) Registration ID It is important for you to have your Registration ID for this purpose. If you have just completed registration, this process will be seamless. Please contact us through our hotline at +65 6772-1288 or email us at pace@sp.edu.sg for further assistance if you are unsure or facing certain difficulty. (iv) Proceed to Payment Link Access our online payment by clicking here –&gt; PACE Online Payment When prompted, input in your Registration ID in the field and proceed by clicking on the View Details button. Please inspect the payment details displayed. To proceed, click on the “Pay Now’ button. (v) Payment options for Online Payment You may choose to make payment online through either the following: Debit/Credit Card Payment Online e-banking/Transfer After which, you may input the required payment information accordingly. Please check the information provided before proceeding. Also, it might help if you check with your bank on whether your card is authorised to perform online transactions. Once done, click on the Submit button to proceed. Please take note of the transaction outcome on whether it is successful or not. If the payment attempt is unsuccessful, you may make another attempt at payment by repeating the above. After making the payment and determine that it was successful, you are strongly encouraged to check your bank balance or other notifications to confirm that the amount has been deducted accordingly. Otherwise, please contact us through our hotline at +65 6772-1288 or email us at pace@sp.edu.sg for further assistance. You may also refer to the video below:"
}
,{
"title": "Payment options",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Paymentoptions.html",
"text": "Payment options Generally, you may present payment to the PACE Academy through the following ways:"
}
,{
"title": "(1) AS AN INDIVIDUAL APPLICANT(S):",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Paymentoptions.html#1-as-an-individual-applicants",
"text": "(1) AS AN INDIVIDUAL APPLICANT(S): SN Options How to? What do I need to do? Remarks 1 Charge Card (Credit/Debit) or Internet Banking Via online payment (via PACE website) or at the SP One-Stop Centre (OSC) You will need your Registration ID e.g. R16000XXXXX We accept payments via VISA/ MasterCard or through internet banking services offered by major local banks only. You may request for a tax receipt by writing in to pace@sp.edu.sg or coming down to the OSC. 2 NETs / NETs Flashpay Over at OSC We require your NRIC/FIN/Passport or Registration ID For cards which support NETs payment service.Please ensure that you are presented with a receipt after the transaction. Cut off time for NETs payment is 30mins before scheduled closure. 3 Cheque Via post or hand over at OSC. Please follow the instructions for cheque payments below. Please ensure that you are presented with a signed receipt if the transaction is done over at the OSC and ensure that it endorsed/validated accordingly. 4 Post-Secondary Education Account (PSEA) Complete the PSEA Ad Hoc Withdrawal Form. WSubmit the completed PSEA form to the OSC upon receiving a payment advice Click to download forms: (A) For part time diploma and post diploma programmes (B) For WSQ and other courses (those allowed by the Ministry of Education) 5 Inter-Bank Transfer or Telegraphic Transfer via banks or agents Please follow the instructions below Please note that you should put in a request with the Programme Administrator before making payment through this option, and update on the transactions details once payment has been made accordingly. 6 SkillsFuture Credit (SFC) via mySkillsFuture Portal for SFC1 and manual form for SFC2 W Please follow the instructions below For selected programmes/courses only. Refer to the specific programme/course web page for eligibility details. 7 Central Provident Fund (CPF) Not applicable Not applicable CPF can only be used for full time diploma programmes and other purposes as approved by the CPF Board. Since our courses/programmes are conducted as CET (part time and short term basis etc.), payment using CPF is NOT allowed."
}
,{
"title": "2) AS A COMPANY SPONSORED APPLICANT(S):",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Paymentoptions.html#2-as-a-company-sponsored-applicants",
"text": "2) AS A COMPANY SPONSORED APPLICANT(S): SN Options How to? What do I need to do? Remarks 1 Corporate Cheque Via post or Over at the OSC. Please follow the instructions below. Please ensure that you are presented with an acknowledgement of receipt at the counter. Our official receipt will be forthcoming once the cheque has been banked in. 2 Inter-Bank GIRO or Telegraphic Transfer Via banks or agents only Please follow the instructions below Please note that you should put in a request with the Programme Administrator before making payment through this option, and update on the transactions details once payment has been made accordingly. Please also note that payments other than Corporate Cheque may disqualify your company from claiming grants/allowances with relevant government agencies (companies are encouraged to make their own verification if necessary on this matter via SkillsConnect)."
}
,{
"title": "(3) INSTRUCTIONS FOR CHEQUE PAYMENTS",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Paymentoptions.html#3-instructions-for-cheque-payments",
"text": "(3) INSTRUCTIONS FOR CHEQUE PAYMENTS Cheques should be made payable to Singapore Polytechnic. Please cross the cheque and write the Registration Reference ID, Applicant Name and NRIC/FIN number on the back of the cheque. Ensure that you provide for the exact amount payable in Singapore Dollars (SGD). Mail the cheque to: ATTN: Manager (WSQ Programmes) Singapore Polytechnic PACE Academy 500 Dover Road Blk T1A, Level 1 Singapore 139651 Please note that an administrative charge of $15 will be imposed for any returned cheques from the bank or financial institution."
}
,{
"title": "(4) INSTRUCTIONS FOR INTER-BANK TRANSFER OR TELEGRAPHIC TRANSFER",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Paymentoptions.html#4-instructions-for-inter-bank-transfer-or-telegraphic-transfer",
"text": "(4) INSTRUCTIONS FOR INTER-BANK TRANSFER OR TELEGRAPHIC TRANSFER We do not encourage participants to make payment using this service as there will be extra bank or services charges levied upon the sender (participant). If no other means is available, please follow the steps below: STEP 1: Inform the Programme Administrator To avoid any complications, please inform your Programme Administrator prior that you will be making payment via transfer directly or writing to us officially with your details to pace@sp.edu.sg. STEP 2: Determine the total amount to be ordered for transfer. PACE Academy requires the exact payable amount to be paid by the participant/company. If there are other charges e.g. bank processing fees, agent charges and taxes, these should be borne or paid by the participant/company. The amount payable, as instructed in the transfer, must be in Singapore Dollars (SGD). If the amount received by PACE Academy ultimately falls short of the amount payable, we will not consider it to be full payment. STEP 3: Instructing your bank Please instruct your bank to transfer payment to: Account Name: Singapore Polytechnic Account Number: 02-059-3368-8 Bank Code: 9496 Branch Code: 002 Swift Code: SCBLSG22XXX Bank’s Name: Standard Chartered Bank (Singapore) Limited Bank’s Address: 8 Marina Boulevard, #27-01, Marina Bay Financial Centre, Singapore 018981 STEP 4: Updating PACE Academy/Singapore Polytechnic Any payment via transfer will not be recognised by us if the participant/company fails to update us on the remittance details. For this purpose, please provide updates by emailing to FIN-Receivables@sp.edu.sg as well as the Programme Administrator concerned."
}
,{
"title": "(5) PAYMENT USING SKILLSFUTURE CREDIT (SFC) 1 and 2",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Paymentoptions.html#5-payment-using-skillsfuture-credit-sfc-1-and-2",
"text": "(5) PAYMENT USING SKILLSFUTURE CREDIT (SFC) 1 and 2 Please check the course/programme is supported under SkillsFuture through the PACE Academy website or the SkillsFuture Credit website (www.skillsfuture.sg/credit). You should also note the following: Information on SFC 1 payment The original SFC was introduced in 2015 with the aim to encourage individual ownership of skills development and lifelong learning. All Singaporeans aged 25 and above were given an opening credit of S$500. After registering for a programme/course on the PACE Academy website, you are still required to log in to the SkillsFuture Credit portal to use your credit balance to pay for your course. The amount payable using SkillsFuture credit should correspond to the amount you pledged on the PACE Academy online registration form. You may only transfer payment to the Training Provider via SkillsFuture Credit Portal within 60 days before the course/programme commencement date. This claim notwithstanding, applicants are required to make prompt payment for any outstanding course fee amount balance. #### Applicable for SFC 2 To further this purpose, a one-off SkillsFuture Credit top-up was announced. From 1 April 2020, $500 will be provided to every Singapore Citizen aged 25 years and above as at 31 December 2020 which can be used on eligible courses. This top-up amount will expire on 31 Dec 2025. Please refer to instructions by the Programme Administrator (PA) after registration. The PA will provide you with a manual form to fill in which will be submitted to the agency concerned on your behalf. If you need further assistance or clarification, please do not hesitate to contact us at 6772-1288 or email to pace@sp.edu.sg."
}
,{
"title": "Making a Withdrawal/Cancellation",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Withdrawal.html",
"text": "Making a Withdrawal/Cancellation"
}
,{
"title": "(i) How to withdrawal/cancel a registeration?",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Withdrawal.html#i-how-to-withdrawalcancel-a-registeration",
"text": "(i) How to withdrawal/cancel a registeration? You may withdraw from a course/programme or cancel a registration at any time by submitting a Withdrawal Form to the PACE Academy. To submit a Withdrawal Form, please click on the corresponding link: (a) For part-time diploma or post diploma programme (b) For all other courses (WSQ, Short Courses etc.)"
}
,{
"title": "(ii) Considerations before withdrawing/cancelling a registration",
"documentTitle": "Customer Experience Guides",
"url": "/opendoc-sp-self-help-centre/3Guides/Withdrawal.html#ii-considerations-before-withdrawingcancelling-a-registration",
"text": "(ii) Considerations before withdrawing/cancelling a registration However, there may be consequences following a withdrawal/cancellation: (1) If payment was made/received, you will be refunded according to the following, based on when the Withdrawal Form is received: 2 weeks before the commencement of the course - 100% (full) refund Less than 2 weeks before commencement of the course - 70% (partial) refund On or after date of commencement - 0% (no) refund (2) For certain courses/programmes, you may no longer be eligible for the same subsidies if you wish to resume. (3) Having made the withdrawal/cancellation, you will no longer be able to complete or continue with the rest of the course/programme. (4) For all courses/programmes, you will not be placed on a priority list to be offered a placement should you decide to resume. (You will be required to make another registration/payment accordingly). (5) For part time diploma/post diploma students, you may make a withdrawal and resume to complete the programme within the candidature period, subject to module and placement availability. We do not have a deferment policy. These students must write in to ptenquiry@sp.edu.sg before the start of the upcoming semester if they wish to re-join/ continue with the programme. NB: Refund may take up to 6-8 weeks."
}
,{
"title": "Test",
"documentTitle": "Assets",
"url": "/opendoc-sp-self-help-centre/assets/images_register/test.html",
"text": "Test"
}
]